# RemoveSegment Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurtainGridLine..::..RemoveSegment Method
CurtainGridLine Class See Also
---
Remove the segment specified by the input curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void RemoveSegment(
	Curve curve
)
```

Visual Basic
---
```text
Public Sub RemoveSegment ( _
	curve As Curve _
)
```

Visual C++
---
```text
public:
void RemoveSegment(
	Curve^ curve
)
```

# ### Parameters
curve
    Type: Autodesk.Revit.DB..::..Curve The curve used to locate the segment to be removed.
# Remarks
When a segment is removed, the neighboring two panels will be merged into one panel. This function will invoke regeneration.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Segment may not have been found in location indicated by curve. |

# See Also
CurtainGridLine Class
Autodesk.Revit.DB Namespace